lvx/base/Enums/бит_ПериодичностьПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПериодичностьПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/бит_ПериодичностьПланирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Определяет начало и окончание даты в зависимости от периодичности.
// 
// Параметры:
//  Дата - Дата.
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования.
//
// Возвращаемое значение:
//  Структура:
//	 * ДатаНачала - Дата.
//	 * ДатаОкончания - Дата.
//
Функция ПараметрыДатыПоПериодичности(Дата, Периодичность) Экспорт
	
	ПараметрыДаты = Новый Структура;
	ПараметрыДаты.Вставить("ДатаНачала",    '00010101');
	ПараметрыДаты.Вставить("ДатаОкончания", '00010101');
	
	Если Периодичность = Перечисления.бит_ПериодичностьПланирования.День Тогда
		ПараметрыДаты.ДатаНачала    = НачалоДня(Дата);
		ПараметрыДаты.ДатаОкончания = КонецДня(Дата);
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Неделя
		ИЛИ Периодичность  = Перечисления.бит_ПериодичностьПланирования.Декада Тогда
		ПараметрыДаты.ДатаНачала    = НачалоНедели(Дата);
		ПараметрыДаты.ДатаОкончания = КонецНедели(Дата);
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Месяц Тогда
		ПараметрыДаты.ДатаНачала    = НачалоМесяца(Дата);
		ПараметрыДаты.ДатаОкончания = КонецМесяца(Дата);
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Квартал Тогда
		ПараметрыДаты.ДатаНачала    = НачалоКвартала(Дата);
		ПараметрыДаты.ДатаОкончания = КонецКвартала(Дата);
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Полугодие Тогда
		НачалоГода      = НачалоГода(Дата);
		НачалоПолугодия = ДобавитьМесяц(НачалоГода, 6);
		Если Дата >= НачалоПолугодия Тогда
			ПараметрыДаты.ДатаНачала    = НачалоПолугодия;
			ПараметрыДаты.ДатаОкончания = КонецГода(Дата);
		Иначе
			ПараметрыДаты.ДатаНачала    = НачалоГода;
			ПараметрыДаты.ДатаОкончания = НачалоПолугодия - 1;
		КонецЕсли;
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Год Тогда
		ПараметрыДаты.ДатаНачала    = НачалоГода(Дата);
		ПараметрыДаты.ДатаОкончания = КонецГода(Дата);
	КонецЕсли;
	
	Возврат ПараметрыДаты;
	
КонецФункции

#КонецОбласти

#КонецЕсли
